zhanglang-jqk/store-devece-esp8266/src/main.cpp
      /* publish relay state to device_pub_topic  -------------------- */
      memset(g_tmpbuf, 0, sizeof(g_tmpbuf));
      if (relay.GetPinState() == DOut::ON_STATUS)
        sprintf((char *)g_tmpbuf, "{\"device_id\":\"%s\",\"relay\":\"on\"}", param.cur_data.device_id);
      else
        sprintf((char *)g_tmpbuf, "{\"device_id\":\"%s\",\"relay\":\"off\"}", param.cur_data.device_id);
      bool isok4 = net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)g_tmpbuf);

      if (isok1 == false || isok2 == false || isok3 == false || isok4 == false)
      {
        tpf("subscribe is failed");
        if (++ctrl_fsm.retry_mqtt_subpub_cnt > ctrl_fsm.RETRY_MQTT_SUBPUB_CNT)
        {
          net_client.Disconnect();
          ctrl_fsm.stat = ctrl_fsm.RETRY_MQTT_CONN_CNT;
          tpf("retry subscribe is failed,then try reconnect mqtt");
        }
      }
      else
      {
        // param.cur_data.count_down_minute = 10;
        // ctrl_fsm.count_down_fsm.count_down_start_f = true;

        tpf("subscribe all topics is successful");
        ctrl_fsm.retry_mqtt_subpub_cnt = 0;
        ctrl_fsm.stat = ctrl_fsm.APP_LOOP_STAT;

        relay.Set(param.cur_data.relay);
      }
    }
    else if (ctrl_fsm.stat == ctrl_fsm.SYS_RESTART_STAT)
    {
      // tp();
      tpf("reset system for retry to run system");
      ESP.restart();
    }
    else if (ctrl_fsm.stat == ctrl_fsm.WIFI_INFO_CONFIG_STAT)
    {
      if (ctrl_fsm.wifi_cfg_fsm.stat == 0)
      {
        tpf("wait for receive wifi info");
        ctrl_fsm.wifi_cfg_fsm.stat = 1;
        // server.send(200, "text/plain", "Received SSID and Password");  // wait for verify that annotation this line whether ok
      }
      else if (ctrl_fsm.wifi_cfg_fsm.stat == 1) // valid wifi info
      {
        logf(".");
        if (ctrl_fsm.web_server_fsm.config_finish_f)
        {
          ln();
          tpf("config wifi infomation is finished");
          net_client.WebServer_stop();
          ctrl_fsm.web_server_fsm.ap_en = false;
          ctrl_fsm.wifi_cfg_fsm.stat = 0;
          ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;
          ctrl_fsm.web_server_fsm.config_finish_f = false;
        }
      }
    }
    else if (ctrl_fsm.stat == ctrl_fsm.APP_LOOP_STAT)
    {
      // tp();
      if (net_client.GetWifiConn() == false)
      {
        tpf("wifi is disconnected, then reconnect to wifi");
        ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;
      }
      else if (net_client.GetMqttConn() == false)
      {
        tpf("mqtt is disconnected, then reconnect to mqtt server");
        ctrl_fsm.stat = ctrl_fsm.CONN_MQTT_SVR_STAT;
      }

      net_client.Loop();
    }
#endif
    ctrl_fsm.last_ms_st = millis();
  }

#if 1
  if (millis() - ctrl_fsm.play_voice_fsm.period_last_ms_st > ctrl_fsm.play_voice_fsm.LOOP_PERIOD_MS) // paly voice logic
  {
    if (ctrl_fsm.play_voice_fsm.play_cmd_f)
    {
      if (ctrl_fsm.play_voice_fsm.stat == 0) // Play voice cmd
      {
        tpf("try to play voice cmd to TTS modules, the voice is %s, try times is %d", ctrl_fsm.play_voice_fsm.playbuf, ctrl_fsm.play_voice_fsm.retry_cnt);

        bool isok = tts.SendPlayVoice_cmd((uint8_t *)ctrl_fsm.play_voice_fsm.playbuf, ctrl_fsm.play_voice_fsm.playbuf_len);

        if (isok)
          ctrl_fsm.play_voice_fsm.stat = 1;
        else
          ctrl_fsm.play_voice_fsm.stat = 2;
      }
      else if (ctrl_fsm.play_voice_fsm.stat == 1) // play voice cmd is successful
      {
        tpf("play voice is successful");

        uint8_t sbuf[32];
        memset(sbuf, 0, sizeof(sbuf));
        cmd_pkt.BuildJsonPkt((char *)sbuf, CmdPkt::PLAY_VOICE, (char *)"ok");
        net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)sbuf);

        ctrl_fsm.play_voice_fsm.play_cmd_f = false;
        ctrl_fsm.play_voice_fsm.stat = 0;
        ctrl_fsm.play_voice_fsm.retry_cnt = 0;
      }
      else if (ctrl_fsm.play_voice_fsm.stat == 2) // play voice cmd is failed
      {
        tpf("retry paly voice cmd to TTS modules again");

        ctrl_fsm.play_voice_fsm.retry_cnt++;
        if (ctrl_fsm.play_voice_fsm.retry_cnt > ctrl_fsm.play_voice_fsm.RETRY_TTS_CNT)
        {
          tpf("retry play voice is failed that try %d times and then publish message to MQTT server", ctrl_fsm.play_voice_fsm.RETRY_TTS_CNT);
          uint8_t sbuf[32];
          memset(sbuf, 0, sizeof(sbuf));
          cmd_pkt.BuildJsonPkt((char *)sbuf, CmdPkt::PLAY_VOICE, (char *)"fail");
          net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)sbuf);

          ctrl_fsm.play_voice_fsm.play_cmd_f = false;
          ctrl_fsm.play_voice_fsm.stat = 0;
          ctrl_fsm.play_voice_fsm.retry_cnt = 0;
        }
        else
        {
          tpf("paly voice cmd again");
          ctrl_fsm.play_voice_fsm.stat = 0;
        }
      }
    }

    ctrl_fsm.play_voice_fsm.period_last_ms_st = millis();
  }
#endif
#if 1 // 数码管显示逻辑
  if (millis() - ctrl_fsm.seg_disp_fsm.main_last_ms >= ctrl_fsm.seg_disp_fsm.MAIN_SCAN_PERIOD_MS)
  {
    if (net_client.GetMqttConn() == false)
    {
      ctrl_fsm.seg_disp_fsm.stat = 1;
    }

    if (ctrl_fsm.seg_disp_fsm.stat == 0) // it display at power on
    {
      disp.DispSeg(0, TM1620::SEG_ROD), disp.DispSeg(1, TM1620::SEG_ROD), disp.DispSeg(2, TM1620::SEG_ROD), disp.DispSeg(3, TM1620::SEG_ROD);
      ctrl_fsm.seg_disp_fsm.stat = 1;
    }
    else if (ctrl_fsm.seg_disp_fsm.stat == 1) // 断网时,数码管闪烁"-"提示
    {
      if (ctrl_fsm.seg_disp_fsm.disp_val_f)
        disp.DispSeg(0, TM1620::SEG_NOT_DISPLAY), disp.DispSeg(1, TM1620::SEG_NOT_DISPLAY), disp.DispSeg(2, TM1620::SEG_NOT_DISPLAY), disp.DispSeg(3, TM1620::SEG_NOT_DISPLAY);
      else
        disp.DispSeg(0, TM1620::SEG_ROD), disp.DispSeg(1, TM1620::SEG_ROD), disp.DispSeg(2, TM1620::SEG_ROD), disp.DispSeg(3, TM1620::SEG_ROD);

      ctrl_fsm.seg_disp_fsm.disp_val_f = !ctrl_fsm.seg_disp_fsm.disp_val_f;

      if (net_client.GetMqttConn() == true)
      {
        disp.DispSeg(0, TM1620::SEG_ROD), disp.DispSeg(1, TM1620::SEG_ROD), disp.DispSeg(2, TM1620::SEG_ROD), disp.DispSeg(3, TM1620::SEG_ROD);
        ctrl_fsm.seg_disp_fsm.stat = 2;
      }
    }
    else if (ctrl_fsm.seg_disp_fsm.stat == 2)
    {
      if (ctrl_fsm.count_down_fsm.stat == 0) // wait for count down enable
      {
        if (ctrl_fsm.count_down_fsm.count_down_start_f) ctrl_fsm.count_down_fsm.stat = 1;
      }
      else if (ctrl_fsm.count_down_fsm.stat == 1) // display count down on number segment
      {

