zhanglang-jqk/store-devece-esp8266/src/main.cpp
  if (strcmp(topic, device_sub_topic) == 0)
  {
    char cmd_no[5];
    memset(cmd_no, 0, sizeof(cmd_no));
    cmd_pkt.GetCmdNo(cmd_no, payload, length);
    tpf("cmd_no:%s", cmd_no);

    if (strcmp(cmd_no, CmdPkt::MODIFY_MQTT_SERVER_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.mqtt_server);
      // param.WriteParam(Param::MQTT_SERVER_ID, param.data.mqtt_server, strlen((char *)param.data.mqtt_server));
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_WIFI_SSID_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.wifi_ssid);
      // param.WriteParam(Param::WIFI_SSID_ID, param.data.wifi_ssid, strlen((char *)param.data.wifi_ssid));
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_WIFI_PWD_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.wifi_pwd);
      // param.WriteParam(Param::WIFI_PWD_ID, param.data.wifi_pwd, strlen((char *)param.data.wifi_pwd));
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_MQTT_USERNAME_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.mqtt_username);
      // param.WriteParam(Param::MQTT_USERNAME_ID, param.data.mqtt_username, strlen((char *)param.data.mqtt_username));
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_MQTT_PASSWORD_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.mqtt_password);
      // param.WriteParam(Param::MQTT_PASSWORD_ID, param.data.mqtt_password, strlen((char *)param.data.mqtt_password));
    }
    else if (strcmp(cmd_no, CmdPkt::OPEN_RELAY_CMD) == 0)
    {
      param.cur_data.relay = (uint8_t)relay.On();
      tpf("received cmd, open relay");
    }
    else if (strcmp(cmd_no, CmdPkt::CLOSE_RELAY_CMD) == 0)
    {
      param.cur_data.relay = (uint8_t)relay.Off();
      tpf("received cmd, close relay");
    }
    else if (strcmp(cmd_no, CmdPkt::GET_RELAY_STATUS_CMD) == 0)
    {
      char sbuf[32];
      memset(sbuf, 0, sizeof(sbuf));
      if (relay.GetPinState() == DOut::ON_STATUS)
        cmd_pkt.BuildJsonPkt(sbuf, CmdPkt::RELAY_STATUS_CMD, (char *)"on");
      else
        cmd_pkt.BuildJsonPkt(sbuf, CmdPkt::RELAY_STATUS_CMD, (char *)"off");

      net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)sbuf);
    }
    else if (strcmp(cmd_no, CmdPkt::GET_DEVICE_ID_CMD) == 0)
    {
      char sbuf[48];
      memset(sbuf, 0, sizeof(sbuf));
      cmd_pkt.BuildJsonPkt(sbuf, CmdPkt::GET_DEVICE_ID_CMD, (char *)param.cur_data.device_id);

      net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)sbuf);
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_MQTT_PORT_CMD) == 0)
    {
      uint16_t port;
      cmd_pkt.ExtractIntOfBuf((char *)payload, length, &port);
      param.cur_data.mqtt_port = port;
    }
    else if (strcmp(cmd_no, CmdPkt::PLAY_VOICE) == 0)
    {
      ctrl_fsm.play_voice_fsm.play_cmd_f = true;
      // cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)ctrl_fsm.play_voice_fsm.playbuf);
      ctrl_fsm.play_voice_fsm.playbuf_len = cmd_pkt.ExtractGbkHexStrOfBuf((char *)payload, length, ctrl_fsm.play_voice_fsm.playbuf);
    }
    else if (strcmp(cmd_no, CmdPkt::SET_COUNT_DOWN) == 0)
    {
      uint16_t count_down = 0;
      cmd_pkt.ExtractIntOfBuf((char *)payload, length, &count_down);
      param.cur_data.count_down_minute = count_down;
      tpf("cound down: %d", count_down);
    }
    else if (strcmp(cmd_no, CmdPkt::OPEN_COUNT_DOWN) == 0)
    {
      tpf("open count down");
      ctrl_fsm.count_down_fsm.count_down_start_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::CLOSE_COUNT_DOWN) == 0)
    {
      tpf("close count down");
      ctrl_fsm.count_down_fsm.count_down_start_f = false;
    }
    else
    {
      tpf("unknow cmd");
    }
  }

#endif
}
#endif

// main.cpp
